{
  "nav": {
    "home": "Home",
    "articles": "Artigos",
    "projects": "Projetos"
  },
  "profile": {
    "role": "Desenvolvedora Full Stack",
    "logo": "Lumah Pereira",
    "slogan": "Código, café e persistência!",
    "displayName": "Lumah Pereira",
    "email": "lumah.pereira26@gmail.com",
    "about": "Minha missão é criar soluções tecnológicas que facilitem o dia a dia das pessoas e ajudem negócios a crescerem de forma inteligente. Estou sempre em busca de aprender novas ferramentas, aprimorar minhas habilidades em desenvolvimento web e colaborar com times diversos e inovadores. Motivada por desafios, apaixonada por código limpo e boas práticas, acredito que a tecnologia é um caminho para transformar realidades — e quero fazer parte dessa mudança.",
    "working": "Desenvolvendo software no",
    "linkedin": "Vamos nos conectar no",
    "github": "Veja meus repositórios no",
    "aboutme": "Sobre"
  },
  "experiences": [
    {
      "company": "Ministério Público do Rio de Janeiro",
      "positions": [
        {
          "title": "Estagiária em Desenvolvimento Full Stack",
          "year": "07.2024 - o momento",
          "description": "- ♦ Atuação no desenvolvimento de aplicações web;- ♦ Apoio na documentação técnica de projetos, garantindo a organização e clareza para a equipe;- ♦ Participação ativa em reuniões, contribuindo com atualizações diárias e alinhamento das tarefas;- ♦ Versionamento de código e integração contínua;- ♦ Apoio na manutenção e organização de ambientes;- ♦ Execução de atividades como refatoração de código, testes unitários e manuais, desenvolvimento de novas funcionalidades e criação de relatórios técnicos;",
          "skills": [
            "JavaScript",
            "TypeScript",
            "React",
            "Git",
            "Python",
            "Django",
            "Scrum",
            "Kanban",
            "MKDocs",
            "Microsoft Azure",
            "Red Hat OpenShift"
          ]
        }
      ]
    },
    {
      "company": "Educação",
      "positions": [
        {
          "title": "Técnologo em Análise e Desenvolvimento de Sistemas | FAETERJ-Rio",
          "year": "03.2023 - o momento",
          "description": "",
          "skills": []
        },
        {
          "title": "NLW Pocket: Javascript - Full-stack Intermediário | Rocketseat",
          "year": "09.2024",
          "description": "",
          "skills": ["Node.js","API REST","TypeScript","Fastify","DrizzleORM","PostgreSQL","Docker","Zod","ReactJS","Typescript","Vite","TailwindCSS","TanStack Query"]
        },
        {
          "title": "Segurança de Endpoints | Cisco",
          "year": "09.2024",
          "description": "Amplo conhecimento dos conceitos básicos de segurança de rede, bem como de sistemas operacionais e segurança de endpoints.",
          "skills": ["Proteção anti-malware","Segurança de aplicações","Ameaças virtuais comuns","Defesa de sistemas e dispositivos","Vulnerabilidades TCP/IP/UDP","Linux básico"]
        },
        {
          "title": "Básico em Redes | Cisco",
          "year": "10.2024",
          "description": "Conhecimento dos tipos de redes, como elas funcionam, como os dispositivos enviam e recebem dados, os tipos de cabeamento de rede, como os endereços IP encontram informações na internet, como o transporte e os aplicativos operam, e prática à construção de uma rede sem fio doméstica.",
          "skills": ["Endereços IPV4","Tipos de rede","Acesso sem fio","Padrões de protocolos"]
        },
        {
          "title": "Design de Bancos de Dados | Oracle Academy",
          "year": "12.2024",
          "description": "Análise de cenários de negócios complexos e na criação de um modelo de dados — uma representação conceitual das informações de uma organização. Examinar os requisitos de dados e a projetar um banco de dados relacional independente de fornecedor. Habilidades de colaboração em grupo e gerenciamento de projetos são desenvolvidas à medida que os modelos de diagramas de entidades e relacionamento são concluídos. Este curso culmina com um projeto que desafia os alunos a projetar uma solução de banco de dados para uma empresa ou organização.",
          "skills": []
        },
        {
          "title": "Defesa de Redes | Cisco",
          "year": "03.2025",
          "description": "Amplo conhecimento de técnicas de monitoramento e proteção de rede, incluindo controle de acesso, firewalls, segurança em nuvem e criptografia. Ele também está familiarizado com a avaliação e resposta a alertas de segurança.",
          "skills": ["Segurança em nuvem","Firewalls","Hashing","Integridade e autenticidade","Segurança física","Criptografia pública e privada"]
        }
      ]
    }
  ]
}